# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\aasys\OneDrive - Drexel University\PSOC4200\PSoc4200\L05P01-MeasuringElapsedTime.cydsn\L05P01-MeasuringElapsedTime.cyprj
# Date: Thu, 15 Feb 2018 12:10:18 GMT
#set_units -time ns
create_clock -name {Clock_2(FFB)} -period 100000 -waveform {0 50000} [list [get_pins {ClockBlock/ff_div_8}]]
create_clock -name {Clock_1(FFB)} -period 100000 -waveform {0 50000} [list [get_pins {ClockBlock/ff_div_9}]]
create_clock -name {UART_SCBCLK(FFB)} -period 8666.6666666666661 -waveform {0 4333.33333333333} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/hfclk}] -edges {1 2401 4801} [list]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 2401 4801} [list]
create_generated_clock -name {UART_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 209 417} -nominal_period 8666.6666666666661 [list]


# Component constraints for C:\Users\aasys\OneDrive - Drexel University\PSOC4200\PSoc4200\L05P01-MeasuringElapsedTime.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\aasys\OneDrive - Drexel University\PSOC4200\PSoc4200\L05P01-MeasuringElapsedTime.cydsn\L05P01-MeasuringElapsedTime.cyprj
# Date: Thu, 15 Feb 2018 12:10:17 GMT
